Clash Bot Workflow - Apply
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Workflow Apply 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Run</summary>

#### Workflow Apply
```

terraform
aws_iam_role.lambda_handler_exec: Refreshing state... [id=clash_bot_event_handler_exec_role-development]
module.clash_bot_event_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/816923827429/clash-bot-event-sqs-development.fifo]
module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=clash-bot-workflow-development]
module.create_team_step_function.data.aws_region.current[0]: Reading...
data.aws_iam_policy_document.event_publisher_policy_document: Reading...
module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=r0loqlg3t3]
data.aws_iam_policy_document.event_handler_policy_document: Reading...
data.aws_acm_certificate.issued: Reading...
module.create_team_step_function.data.aws_caller_identity.current: Reading...
aws_cloudwatch_log_group.api_gateway_default_log_group: Refreshing state... [id=api_gateway_default_log_group-development]
data.aws_iam_policy_document.event_handler_policy_document: Read complete after 0s [id=927500948]
data.aws_iam_policy_document.event_publisher_policy_document: Read complete after 0s [id=927500948]
module.create_team_step_function.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
aws_iam_policy.event_publisher_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ClashBotEventPublisherPolicy-development]
aws_iam_role.lambda_publisher_exec: Refreshing state... [id=clash_bot_event_publisher_exec_role-development]
aws_iam_policy.event_handler_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowEventHandlerPolicy-development]
module.create_team_step_function.data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=4239894905]
module.create_team_step_function.aws_iam_role.this[0]: Refreshing state... [id=retrieve-teams-development]
aws_iam_role_policy_attachment.lambda_handler_exec_policy: Refreshing state... [id=clash_bot_event_handler_exec_role-development-20231114032927103900000001]
aws_iam_role_policy_attachment.lambda_publisher_exec_policy: Refreshing state... [id=clash_bot_event_publisher_exec_role-development-20231114032927127100000002]
aws_lambda_function.event_publisher_lambda: Refreshing state... [id=clash-bot-event-publisher-development]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Refreshing state... [id=arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development]
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Read complete after 0s [id=3233016293]
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Refreshing state... [id=arn:aws:iam::816923827429:policy/retrieve-teams-development-dynamodb]
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Refreshing state... [id=retrieve-teams-development-dynamodb]
data.aws_acm_certificate.issued: Read complete after 0s [id=arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a]
module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Refreshing state... [id=clash-bot.ninja]
aws_lambda_function.event_handler_lambda: Refreshing state... [id=clash-bot-event-handler-development]
module.api_gateway.aws_apigatewayv2_integration.this["POST /api/v2/teams"]: Refreshing state... [id=zlvcq9c]
module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
aws_lambda_permission.apigw: Refreshing state... [id=AllowExecutionFromAPIGateway-development]
module.api_gateway.aws_apigatewayv2_route.this["POST /api/v2/teams"]: Refreshing state... [id=i2to2qo]
module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Refreshing state... [id=gt4pmg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_event_source_mapping.sqs_trigger will be created
  + resource "aws_lambda_event_source_mapping" "sqs_trigger" {
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
      + function_arn                  = (known after apply)
      + function_name                 = "clash-bot-event-handler-development"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_lambda_event_source_mapping.sqs_trigger: Creating...
aws_lambda_event_source_mapping.sqs_trigger: Still creating... [10s elapsed]
aws_lambda_event_source_mapping.sqs_trigger: Creation complete after 14s [id=5d76167c-6bd9-488d-aee8-c6d122a624c1]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

api-gateway-endpoint = "https://r0loqlg3t3.execute-api.us-east-1.amazonaws.com"
event-handler-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-handler-development"
event-handler-lambda-version = "$LATEST"
event-publisher-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-publisher-development"
event-publisher-lambda-version = "$LATEST"
event-sqs = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
step-function-arn = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development"

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*